{"meta":{"title":"Recipe Repo!","subtitle":"Recipe storage","description":"","author":"Tim Strazzere","url":"http://recipes.strazzere.com","root":"/"},"pages":[],"posts":[{"title":"low-knead-crusty-bread","slug":"low-knead-crusty-bread","date":"2020-04-19T18:08:38.000Z","updated":"2020-04-19T18:32:59.093Z","comments":true,"path":"2020/04/19/low-knead-crusty-bread/","link":"","permalink":"http://recipes.strazzere.com/2020/04/19/low-knead-crusty-bread/","excerpt":"","text":"The easiest bread making recipe I’ve found, somewhat of a mixture of other recipes, but changes slightly to work for me in Oakland, as I work from home, during the COVID-19 issues. This was basically the thing that was “like sourdough” but not, as I was using instant yeast and didn’t want to keep trying to making a sourdough starter. Gotcha’s I found while making this; Know your oven’s true temperature. The degrees need to be pretty spot on, if you have cold spots of it’s off by 25°, etc - it won’t look as good. Get an oven thermometer The dutch oven makes a difference, I couldn’t get good shapes/rises/coloring without it, plus it was pretty simple to use, just do it. I’ve started taking the temperature of the water added, 105° is the target I’ve been keeping, seems to work best, especially as my kitchen is “cold” (~60°-65°) in comparison to all the books I’ve read… Primarily based off of King Arthur Flour’s No knead Crusty White Bread Recipe Below yields 2-3 loaves, though it seems like the perfect amount for 2 good sized loaves in my testing. Ingredients(dry) 907g flour 14g of instant yeast (SAF-Instant is what I’ve used) 1 Tablespoon of coarse sea salt (wet) 680g of lukewarm water (105° worked best for me) InstructionsAhead Prep Measure incredients seperately, put flour directly KitchenAidbowl. Attach mixing blade, turn on. Slowly begin to pour waterinto the bowl. After mostly mixed, scrape the blade with a doughscraper, add dough hook, but let the water/flour combination sitfor 5 minutes. Turn on kitchen aid again with dough hook, one click, begin to addsalt, then yeast. Let mix for ~60 seconds. If needed, scrape sidesand/or hook if salt or yeast is visible. Stop mixer, remove attachment and cover bowl for a minimum of 2 hoursand let the dough rise while covered with reynolds wrap. After allowing the dough to rise, place into fridge for a minimum of2 hours, or leave over night (few days seems fine too). Baking About an hour and a half before you want to have the bread, removedought from fridge, cut approximately half of the dough out and placeon a floured surface, like parchment paper. Return the rest to the fridge.Lightly shape it to whatever shape you’d like, preferably a ball fora dutch oven, and dust with flour to retain moisture. Cover with a towl.Rest this for a minimum of an hour - but do a touch test to ensure it isready before using. Preheat the oven and cast iron to 450°, this will take approximately ~30minutes, so time this to start approximately a half hour after resting thedough. After the dough has rested for an hour, take the dutch oven out and plunkthe dough directly into the dutch oven. No need to grease it or use parchmentpaper. Place cover back in, return dutch oven to the oven, cook for ~25-30minutes with lid on. When the first part of cooking is done, remove the lid, and cook for another~15-20 minutes depending on what you want the bread to look like. Remove dutch oven and “dump” the bread out, should come out easily, andrest it on a rack for a few minutes. Slice, nom, dip in oil/soup/butter. Extras / Ideas Add rosemary or other dry herbs with the rest of the dry ingredients. Just divide the ingredient in half if need be, keep the ratios. Everything in half willmake one really good loaf TODO: Picture(s) during next time making them Figure out how to add olives/etc similar to Flying Pig bread.","categories":[{"name":"baking","slug":"baking","permalink":"http://recipes.strazzere.com/categories/baking/"}],"tags":[{"name":"baking","slug":"baking","permalink":"http://recipes.strazzere.com/tags/baking/"},{"name":"no-yeast","slug":"no-yeast","permalink":"http://recipes.strazzere.com/tags/no-yeast/"},{"name":"dinner","slug":"dinner","permalink":"http://recipes.strazzere.com/tags/dinner/"},{"name":"next-day","slug":"next-day","permalink":"http://recipes.strazzere.com/tags/next-day/"},{"name":"same-day","slug":"same-day","permalink":"http://recipes.strazzere.com/tags/same-day/"}]},{"title":"Quick Butter Biscuits","slug":"quick-butter-biscuits","date":"2020-04-02T07:00:00.000Z","updated":"2020-04-19T18:39:56.839Z","comments":true,"path":"2020/04/02/quick-butter-biscuits/","link":"","permalink":"http://recipes.strazzere.com/2020/04/02/quick-butter-biscuits/","excerpt":"","text":"Buttery, soft, quick and easy to make. Might taste a bit “doughy” to some folks. Keeps well for ~3 or 4 days sealing in a container, room temp. No yeast needed, easy substitutions as well. Ingredients(dry) 2 cups of flour 1 Tablespoon of baking powder 1 Tablespoon of granulated sugar 1 teaspoon of salt (wet) 6 Tablespoons of cold butter (unsalted) 3/4 cup of whole milk (or ~1 cup of heavy whipping cream, ends up extra dense) Instructions Chill butter in freezer for ~30 minutes, preheat over to 425°, line baking sheet with parchment paper Combine all dry ingredients in bowl Use box grater on butter, add to dry ingredients, gently combine with spatula/spoon Add milk, gently combine until just barely mixed Transfer to floured surface, fold in half with hands and rotate 90°, repeat ~5 to 6 times, do not over work (will become more dense!) Flatten dough with hand to ~1”, user mason jar lid to cut out biscuits, place on baking sheet Bake for ~12 minutes, brush top with melted butter, add a dash of Morton’s salt to top Extras / Ideas Add rosemary or other dry herbs with the rest of the dry ingredients. Cheddar / Scallions could be a good mix, add immediately before chilled butter probably Biscuits tend to look a bit pale, potentially try and egg wash to make them more brown? TODO: Picture(s) during next time making them Test egg wash idea Figure out more combinations to add","categories":[{"name":"baking","slug":"baking","permalink":"http://recipes.strazzere.com/categories/baking/"}],"tags":[{"name":"baking","slug":"baking","permalink":"http://recipes.strazzere.com/tags/baking/"},{"name":"no-yeast","slug":"no-yeast","permalink":"http://recipes.strazzere.com/tags/no-yeast/"},{"name":"quick","slug":"quick","permalink":"http://recipes.strazzere.com/tags/quick/"},{"name":"breakfast","slug":"breakfast","permalink":"http://recipes.strazzere.com/tags/breakfast/"},{"name":"dinner","slug":"dinner","permalink":"http://recipes.strazzere.com/tags/dinner/"}]}],"categories":[{"name":"baking","slug":"baking","permalink":"http://recipes.strazzere.com/categories/baking/"}],"tags":[{"name":"baking","slug":"baking","permalink":"http://recipes.strazzere.com/tags/baking/"},{"name":"no-yeast","slug":"no-yeast","permalink":"http://recipes.strazzere.com/tags/no-yeast/"},{"name":"dinner","slug":"dinner","permalink":"http://recipes.strazzere.com/tags/dinner/"},{"name":"next-day","slug":"next-day","permalink":"http://recipes.strazzere.com/tags/next-day/"},{"name":"same-day","slug":"same-day","permalink":"http://recipes.strazzere.com/tags/same-day/"},{"name":"quick","slug":"quick","permalink":"http://recipes.strazzere.com/tags/quick/"},{"name":"breakfast","slug":"breakfast","permalink":"http://recipes.strazzere.com/tags/breakfast/"}]}