{"meta":{"title":"Recipe Repo!","subtitle":"Recipe storage","description":"","author":"Tim Strazzere","url":"https://recipes.strazzere.com","root":"/"},"pages":[{"title":"About","date":"2020-04-23T07:00:00.000Z","updated":"2020-04-30T18:13:39.041Z","comments":true,"path":"about/index.html","permalink":"https://recipes.strazzere.com/about/index.html","excerpt":"","text":"Figured it was finally time to post the recipes I always use, lose and somewhat forget online. Since LeeAnn and I are trapped indoors because of COVID-19, now seemed like a good time to start tossing things onto this site. Maybe it will come in handy for ourselves, someone we don’t know, or even out children sometime?"}],"posts":[{"title":"Ma's Macaroni and Cheese","slug":"macaroni-and-cheese","date":"2020-10-23T07:00:00.000Z","updated":"2020-10-23T17:02:04.273Z","comments":true,"path":"2020/10/23/macaroni-and-cheese/","link":"","permalink":"https://recipes.strazzere.com/2020/10/23/macaroni-and-cheese/","excerpt":"","text":"Archiving this recipe even though I’ve not actually ever made this one. This is from a collection my father sent me when my Grandmother passed away - the collection is titled Ma’s Recipes. Substitute brands / ingredients as needed, brand names preserved because of memories even though I can’t find some of these on the West Coast. Miss you Grandma. Ingredients 1 bag of egg noodles 1 can Cream of Chicken soup 1 can (used empty soup can) milk 1 can Italian grated parmesan cheese 1 can of mayonaise Salt and pepper to taste Instructions Boil noodles according to packages directions, drain. Mix all ingredients together in pasta pot Pour into greased 9 x 12 inch pan Bake at 325 degrees for 35-40 minutes Extras / IdeasSautee some garlic and onions before baking?Add some red pepper flakes?","categories":[{"name":"sides","slug":"sides","permalink":"https://recipes.strazzere.com/categories/sides/"}],"tags":[{"name":"dinner","slug":"dinner","permalink":"https://recipes.strazzere.com/tags/dinner/"},{"name":"ma's","slug":"ma-s","permalink":"https://recipes.strazzere.com/tags/ma-s/"},{"name":"sides","slug":"sides","permalink":"https://recipes.strazzere.com/tags/sides/"},{"name":"cheese","slug":"cheese","permalink":"https://recipes.strazzere.com/tags/cheese/"}]},{"title":"Ma's Pasta e Piselli","slug":"pasta-e-piselli","date":"2020-10-22T07:00:00.000Z","updated":"2020-10-22T18:10:40.278Z","comments":true,"path":"2020/10/22/pasta-e-piselli/","link":"","permalink":"https://recipes.strazzere.com/2020/10/22/pasta-e-piselli/","excerpt":"","text":"Similar to the previous recipe - I’ve not made this in a very long time. Though this is from a collection my father sent me when my Grandmother passed away - the collection is titled Ma’s Recipes. Substitute brands / ingredients as needed, brand names preserved because of memories even though I can’t find some of these on the West Coast. Miss you Grandma. Ingredients 1/2 cup olive oil 1 small onion chopped 1 large garlic clove, chopped 1 14oz can Hunts Whole Tomatoes 1 8oz can medium sized sweet peas 1 lb small shells (ditalini or thin spaghetti broken into 1 inch pieces) Small amount of red pepper flakes Instructions Heat up olive oil and saute onions until soft, then add garlic. Add canned tomatoes and juice, squeeze tomatoes to break them up, add red pepper flakes. Stir and cook for about 15 minutes on medium heat. Add undrained can of peas, let the sauce simmer. Taste and see if it has enough seasoning, add various spices as needed. Cook for at least 30 minutes. Cook pasta/macaroni separately, drain. ServingPut small macaroni into soup bowls - ladle mixture over pasta. Add grated Parmesan or Romano cheese. Other notes from Ma’I usually put some macaroni in a soup bowl and put the mixture over it.If the mixture seem too thick you can add a can of chicken broth.If you like more peas, add another can. Experiment!","categories":[{"name":"soup","slug":"soup","permalink":"https://recipes.strazzere.com/categories/soup/"},{"name":"italian","slug":"soup/italian","permalink":"https://recipes.strazzere.com/categories/soup/italian/"}],"tags":[{"name":"dinner","slug":"dinner","permalink":"https://recipes.strazzere.com/tags/dinner/"},{"name":"ma's","slug":"ma-s","permalink":"https://recipes.strazzere.com/tags/ma-s/"}]},{"title":"Ma's Pasta e Fagioli","slug":"pasta-e-fagioli","date":"2020-10-21T07:00:00.000Z","updated":"2020-10-22T17:42:49.250Z","comments":true,"path":"2020/10/21/pasta-e-fagioli/","link":"","permalink":"https://recipes.strazzere.com/2020/10/21/pasta-e-fagioli/","excerpt":"","text":"Archiving this recipe even though I’ve not made it in forever. This is from a collection my father sent me when my Grandmother passed away - the collection is titled Ma’s Recipes. Substitute brands / ingredients as needed, brand names preserved because of memories even though I can’t find some of these on the West Coast. Miss you Grandma. Ingredients 3 Tablespoons of olive oil 1 cup cut onions 1 cup celery 1 clove garlic chopped 1 8oz can of Hunts Whole Tomatoes 1 small can College Inn Chicken Broth 1 can Progresso Kidney Beans (drained) Pinch of dried red pepper flakes Salt and pepper to taste Instructions Saute onions, celery with olive oil on low heat, add seasonings. Add garlic when nearly done. Add tomatoes and crush them, simmer for approximately 10 minutes. Add chicken broth. Cook for about 30 minutes. Add beans. Taste – if prefered add more broth, beans or whatever. Cook small macaroni separately. ServingPut small macaroni into soup bowls - ladle mixture over pasta. Add grated cheese as needed","categories":[{"name":"soup","slug":"soup","permalink":"https://recipes.strazzere.com/categories/soup/"},{"name":"italian","slug":"soup/italian","permalink":"https://recipes.strazzere.com/categories/soup/italian/"}],"tags":[{"name":"dinner","slug":"dinner","permalink":"https://recipes.strazzere.com/tags/dinner/"},{"name":"ma's","slug":"ma-s","permalink":"https://recipes.strazzere.com/tags/ma-s/"}]},{"title":"Rye-ish Sandwich Bread","slug":"rye-bread-mod","date":"2020-05-02T07:00:00.000Z","updated":"2020-05-03T03:32:32.652Z","comments":true,"path":"2020/05/02/rye-bread-mod/","link":"","permalink":"https://recipes.strazzere.com/2020/05/02/rye-bread-mod/","excerpt":"","text":"Sticking with the OG low knead crusty bread and adding some randomness because I had it, and read “5% rye is good” - with no actual photos or reasoning behind it. So, sure, why not try it? Should yield one, largish, loaf for sandos. Ingredients(dry) 430g white flour 24g rye flour 10g of instant yeast (SAF-Instant is what I’ve used) 1/2 Tablespoon of coarse sea salt 2 Tablespoons of “everything but the bagel” (wet) 340g of lukewarm water (105° worked best for me) Instructions(Same as other, repeated here and tweaked just for exact timing I used) Ahead Prep Measure incredients seperately, put flour directly KitchenAidbowl. Attach mixing blade, turn on. Slowly begin to pour waterinto the bowl. After mostly mixed, scrape the blade with a doughscraper, add dough hook, but let the water/flour combination sitfor 5 minutes. Turn on kitchen aid again with dough hook, one click, begin to addsalt, then yeast, then “everything but the bagel” seasoning. Letmix for ~60 seconds. If needed, scrape sides and/or hook if saltor yeast is visible. Stop mixer, remove attachment and cover bowl for a minimum of 2 hoursand let the dough rise while covered with reynolds wrap. After allowing the dough to rise, place into fridge for a minimum of2 hours Baking About an hour and a half before you want to have the bread, removedought from fridge, cut approximately half of the dough out and placeon a floured surface, like parchment paper. Return the rest to the fridge.Lightly shape it to whatever shape you’d like, preferably a ball fora dutch oven, and dust with flour to retain moisture. Cover with a towl.Rest this for a minimum of an hour - but do a touch test to ensure it isready before using. Dash with poppy seeds (didn’t really stick? maybe do this before flour) Preheat the oven and cast iron to 450°, this will take approximately ~30minutes, so time this to start approximately a half hour after resting thedough. After the dough has rested for an hour, take the dutch oven out and plunkthe dough directly into the dutch oven. No need to grease it or use parchmentpaper. Place cover back in, return dutch oven to the oven, cook for ~25minutes with lid on. When the first part of cooking is done, remove the lid, and cook for another~20 minutes depending on what you want the bread to look like. Remove dutch oven and “dump” the bread out, should come out easily, andrest it on a rack for a few minutes. Slice, nom, dip in oil/soup/butter. Not a bad turn out?","categories":[{"name":"baking","slug":"baking","permalink":"https://recipes.strazzere.com/categories/baking/"}],"tags":[{"name":"baking","slug":"baking","permalink":"https://recipes.strazzere.com/tags/baking/"},{"name":"dinner","slug":"dinner","permalink":"https://recipes.strazzere.com/tags/dinner/"},{"name":"same-day","slug":"same-day","permalink":"https://recipes.strazzere.com/tags/same-day/"},{"name":"lunch","slug":"lunch","permalink":"https://recipes.strazzere.com/tags/lunch/"},{"name":"sandwich","slug":"sandwich","permalink":"https://recipes.strazzere.com/tags/sandwich/"}]},{"title":"Wheat Sandwich Bread","slug":"wheat-bread-mod","date":"2020-04-29T07:00:00.000Z","updated":"2020-04-30T18:08:20.441Z","comments":true,"path":"2020/04/29/wheat-bread-mod/","link":"","permalink":"https://recipes.strazzere.com/2020/04/29/wheat-bread-mod/","excerpt":"","text":"Mutating the recipe from the low knead crusty bread and just for the sake of keeping a record of the trial, here is a shortly part wheat crusty bread attempt. Should yield one, largish, loaf for sandos. Ingredients(dry) 454g flour 150g whole wheat flour 7g of instant yeast (SAF-Instant is what I’ve used) 1/2 Tablespoon of coarse sea salt (wet) 340g of lukewarm water (105° worked best for me) Instructions(Same as other, repeated here and tweaked just for exact timing I used) Ahead Prep Measure incredients seperately, put flour directly KitchenAidbowl. Attach mixing blade, turn on. Slowly begin to pour waterinto the bowl. After mostly mixed, scrape the blade with a doughscraper, add dough hook, but let the water/flour combination sitfor 5 minutes. Turn on kitchen aid again with dough hook, one click, begin to addsalt, then yeast. Let mix for ~60 seconds. If needed, scrape sidesand/or hook if salt or yeast is visible. Stop mixer, remove attachment and cover bowl for a minimum of 2 hoursand let the dough rise while covered with reynolds wrap. After allowing the dough to rise, place into fridge for a minimum of2 hours Baking About an hour and a half before you want to have the bread, removedought from fridge, cut approximately half of the dough out and placeon a floured surface, like parchment paper. Return the rest to the fridge.Lightly shape it to whatever shape you’d like, preferably a ball fora dutch oven, and dust with flour to retain moisture. Cover with a towl.Rest this for a minimum of an hour - but do a touch test to ensure it isready before using. Dash with poppy seeds (didn’t really stick? maybe do this before flour) Preheat the oven and cast iron to 450°, this will take approximately ~30minutes, so time this to start approximately a half hour after resting thedough. After the dough has rested for an hour, take the dutch oven out and plunkthe dough directly into the dutch oven. No need to grease it or use parchmentpaper. Place cover back in, return dutch oven to the oven, cook for ~25minutes with lid on. When the first part of cooking is done, remove the lid, and cook for another~20 minutes depending on what you want the bread to look like. Remove dutch oven and “dump” the bread out, should come out easily, andrest it on a rack for a few minutes. Slice, nom, dip in oil/soup/butter. Extras / Ideas Was “less sweet” than all white version of the bread, extra soft and consistent on the holes.","categories":[{"name":"baking","slug":"baking","permalink":"https://recipes.strazzere.com/categories/baking/"}],"tags":[{"name":"baking","slug":"baking","permalink":"https://recipes.strazzere.com/tags/baking/"},{"name":"dinner","slug":"dinner","permalink":"https://recipes.strazzere.com/tags/dinner/"},{"name":"same-day","slug":"same-day","permalink":"https://recipes.strazzere.com/tags/same-day/"},{"name":"lunch","slug":"lunch","permalink":"https://recipes.strazzere.com/tags/lunch/"},{"name":"sandwich","slug":"sandwich","permalink":"https://recipes.strazzere.com/tags/sandwich/"}]},{"title":"Candied Serranos","slug":"candied-serranos","date":"2020-04-24T05:29:15.000Z","updated":"2020-04-24T05:51:05.492Z","comments":true,"path":"2020/04/23/candied-serranos/","link":"","permalink":"https://recipes.strazzere.com/2020/04/23/candied-serranos/","excerpt":"","text":"A few years back I was in Fresno for a volleyball tournament and there was a smoked candied jalapeno condiment at one of the food trucks. Took a photo of the jar so I could look it up online, but somehow never saved the photo. Tried a few other brands, but they always seem too sweet and not hot enough, or just mush. After looking at a bunch of recipes online, it seemed easy enough so I made some while I’m all couped up. Ingredients 5 cups of sugar 1 Tablespoon of garlic powder 1/2 Tablespoon of smoked paprika 1/2 Tablespoon of celery seed 1/2 Tablespoon of chipolte 1 1/2 cups of apple cider vinegar 1 1/2 lbs of sliced serrano peppers Instructions Mix all the ingredients, except for the peppers in a large pot. Bringto a boil, reduce heat and let simmer while you slice the peppers. Tosspepper stems. Allow mixture to simmer for at least 6 minutes, occasionally stiring. Add sliced peppers, ensure they’re all covered and bring to a slight boilfor at least 4 minutes. This timing will determine how mushy/firm the pepperswill be. Remove the peppers with a slotted spoon, fill canning jars, ladel in the sugarmixture. Poke things around with a the handle of a spoon to ride air bubbles. Seal jar however you prefer. Keep the extra sugar mixture as it’s basicallya simple syrup infused with serranos. TODO Try smoking the peppers, might make them too mushy? See what the hottest level pepper this would be good for, habaneros/reapers/ghost chilis are likely all too thin for this? see how much we can reduce the sugar content and still get the same texture","categories":[{"name":"condiment","slug":"condiment","permalink":"https://recipes.strazzere.com/categories/condiment/"}],"tags":[{"name":"appetizer","slug":"appetizer","permalink":"https://recipes.strazzere.com/tags/appetizer/"},{"name":"spicy","slug":"spicy","permalink":"https://recipes.strazzere.com/tags/spicy/"},{"name":"peppers","slug":"peppers","permalink":"https://recipes.strazzere.com/tags/peppers/"}]},{"title":"low-knead-crusty-bread","slug":"low-knead-crusty-bread","date":"2020-04-19T07:00:00.000Z","updated":"2020-04-30T18:08:11.020Z","comments":true,"path":"2020/04/19/low-knead-crusty-bread/","link":"","permalink":"https://recipes.strazzere.com/2020/04/19/low-knead-crusty-bread/","excerpt":"","text":"The easiest bread making recipe I’ve found, somewhat of a mixture of other recipes, but changes slightly to work for me in Oakland, as I work from home, during the COVID-19 issues. This was basically the thing that was “like sourdough” but not, as I was using instant yeast and didn’t want to keep trying to making a sourdough starter. Gotcha’s I found while making this; Know your oven’s true temperature. The degrees need to be pretty spot on, if you have cold spots of it’s off by 25°, etc - it won’t look as good. Get an oven thermometer The dutch oven makes a difference, I couldn’t get good shapes/rises/coloring without it, plus it was pretty simple to use, just do it. I’ve started taking the temperature of the water added, 105° is the target I’ve been keeping, seems to work best, especially as my kitchen is “cold” (~60°-65°) in comparison to all the books I’ve read… Primarily based off of King Arthur Flour’s No knead Crusty White Bread Recipe Below yields 2-3 loaves, though it seems like the perfect amount for 2 good sized loaves in my testing. Ingredients(dry) 907g flour when making “sandwich bread” I do 807g white flour and 100g rye 14g of instant yeast (SAF-Instant is what I’ve used) 1 Tablespoon of coarse sea salt (wet) 680g of lukewarm water (105° worked best for me) InstructionsAhead Prep Measure incredients seperately, put flour directly KitchenAidbowl. Attach mixing blade, turn on. Slowly begin to pour waterinto the bowl. After mostly mixed, scrape the blade with a doughscraper, add dough hook, but let the water/flour combination sitfor 5 minutes. Turn on kitchen aid again with dough hook, one click, begin to addsalt, then yeast. Let mix for ~60 seconds. If needed, scrape sidesand/or hook if salt or yeast is visible. Stop mixer, remove attachment and cover bowl for a minimum of 2 hoursand let the dough rise while covered with reynolds wrap. After allowing the dough to rise, place into fridge for a minimum of2 hours, or leave over night (few days seems fine too). Baking About an hour and a half before you want to have the bread, removedought from fridge, cut approximately half of the dough out and placeon a floured surface, like parchment paper. Return the rest to the fridge.Lightly shape it to whatever shape you’d like, preferably a ball fora dutch oven, and dust with flour to retain moisture. Cover with a towl.Rest this for a minimum of an hour - but do a touch test to ensure it isready before using. Preheat the oven and cast iron to 450°, this will take approximately ~30minutes, so time this to start approximately a half hour after resting thedough. After the dough has rested for an hour, take the dutch oven out and plunkthe dough directly into the dutch oven. No need to grease it or use parchmentpaper. Place cover back in, return dutch oven to the oven, cook for ~25-30minutes with lid on. When the first part of cooking is done, remove the lid, and cook for another~15-20 minutes depending on what you want the bread to look like. Remove dutch oven and “dump” the bread out, should come out easily, andrest it on a rack for a few minutes. Slice, nom, dip in oil/soup/butter. Extras / Ideas Add rosemary or other dry herbs with the rest of the dry ingredients. Just divide the ingredient in half if need be, keep the ratios. Everything in half willmake one really good loaf As noted under directions, for sandwich bread (bit more savory) use 100g of rye flour and the rest white flour TODO: Figure out how to add olives/etc similar to Flying Pig bread.","categories":[{"name":"baking","slug":"baking","permalink":"https://recipes.strazzere.com/categories/baking/"}],"tags":[{"name":"baking","slug":"baking","permalink":"https://recipes.strazzere.com/tags/baking/"},{"name":"dinner","slug":"dinner","permalink":"https://recipes.strazzere.com/tags/dinner/"},{"name":"next-day","slug":"next-day","permalink":"https://recipes.strazzere.com/tags/next-day/"},{"name":"same-day","slug":"same-day","permalink":"https://recipes.strazzere.com/tags/same-day/"}]},{"title":"Quick Butter Biscuits","slug":"quick-butter-biscuits","date":"2020-04-02T07:00:00.000Z","updated":"2020-04-19T18:39:56.839Z","comments":true,"path":"2020/04/02/quick-butter-biscuits/","link":"","permalink":"https://recipes.strazzere.com/2020/04/02/quick-butter-biscuits/","excerpt":"","text":"Buttery, soft, quick and easy to make. Might taste a bit “doughy” to some folks. Keeps well for ~3 or 4 days sealing in a container, room temp. No yeast needed, easy substitutions as well. Ingredients(dry) 2 cups of flour 1 Tablespoon of baking powder 1 Tablespoon of granulated sugar 1 teaspoon of salt (wet) 6 Tablespoons of cold butter (unsalted) 3/4 cup of whole milk (or ~1 cup of heavy whipping cream, ends up extra dense) Instructions Chill butter in freezer for ~30 minutes, preheat over to 425°, line baking sheet with parchment paper Combine all dry ingredients in bowl Use box grater on butter, add to dry ingredients, gently combine with spatula/spoon Add milk, gently combine until just barely mixed Transfer to floured surface, fold in half with hands and rotate 90°, repeat ~5 to 6 times, do not over work (will become more dense!) Flatten dough with hand to ~1”, user mason jar lid to cut out biscuits, place on baking sheet Bake for ~12 minutes, brush top with melted butter, add a dash of Morton’s salt to top Extras / Ideas Add rosemary or other dry herbs with the rest of the dry ingredients. Cheddar / Scallions could be a good mix, add immediately before chilled butter probably Biscuits tend to look a bit pale, potentially try and egg wash to make them more brown? TODO: Picture(s) during next time making them Test egg wash idea Figure out more combinations to add","categories":[{"name":"baking","slug":"baking","permalink":"https://recipes.strazzere.com/categories/baking/"}],"tags":[{"name":"baking","slug":"baking","permalink":"https://recipes.strazzere.com/tags/baking/"},{"name":"dinner","slug":"dinner","permalink":"https://recipes.strazzere.com/tags/dinner/"},{"name":"breakfast","slug":"breakfast","permalink":"https://recipes.strazzere.com/tags/breakfast/"},{"name":"quick","slug":"quick","permalink":"https://recipes.strazzere.com/tags/quick/"},{"name":"no-yeast","slug":"no-yeast","permalink":"https://recipes.strazzere.com/tags/no-yeast/"}]}],"categories":[{"name":"sides","slug":"sides","permalink":"https://recipes.strazzere.com/categories/sides/"},{"name":"soup","slug":"soup","permalink":"https://recipes.strazzere.com/categories/soup/"},{"name":"italian","slug":"soup/italian","permalink":"https://recipes.strazzere.com/categories/soup/italian/"},{"name":"baking","slug":"baking","permalink":"https://recipes.strazzere.com/categories/baking/"},{"name":"condiment","slug":"condiment","permalink":"https://recipes.strazzere.com/categories/condiment/"}],"tags":[{"name":"dinner","slug":"dinner","permalink":"https://recipes.strazzere.com/tags/dinner/"},{"name":"ma's","slug":"ma-s","permalink":"https://recipes.strazzere.com/tags/ma-s/"},{"name":"sides","slug":"sides","permalink":"https://recipes.strazzere.com/tags/sides/"},{"name":"cheese","slug":"cheese","permalink":"https://recipes.strazzere.com/tags/cheese/"},{"name":"baking","slug":"baking","permalink":"https://recipes.strazzere.com/tags/baking/"},{"name":"same-day","slug":"same-day","permalink":"https://recipes.strazzere.com/tags/same-day/"},{"name":"lunch","slug":"lunch","permalink":"https://recipes.strazzere.com/tags/lunch/"},{"name":"sandwich","slug":"sandwich","permalink":"https://recipes.strazzere.com/tags/sandwich/"},{"name":"appetizer","slug":"appetizer","permalink":"https://recipes.strazzere.com/tags/appetizer/"},{"name":"spicy","slug":"spicy","permalink":"https://recipes.strazzere.com/tags/spicy/"},{"name":"peppers","slug":"peppers","permalink":"https://recipes.strazzere.com/tags/peppers/"},{"name":"next-day","slug":"next-day","permalink":"https://recipes.strazzere.com/tags/next-day/"},{"name":"breakfast","slug":"breakfast","permalink":"https://recipes.strazzere.com/tags/breakfast/"},{"name":"quick","slug":"quick","permalink":"https://recipes.strazzere.com/tags/quick/"},{"name":"no-yeast","slug":"no-yeast","permalink":"https://recipes.strazzere.com/tags/no-yeast/"}]}